In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('meteorite.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               45716 non-null  object
 1   id                 45716 non-null  int64
 2   name_type          45716 non-null  object
 3   class              45716 non-null  object
 4   mass               45585 non-null  float64
 5   fall               45716 non-null  object
 6   year               45716 non-null  int64
 7   lat                38401 non-null  float64
 8   long               38401 non-null  float64
 9   geolocation        38401 non-null  object
 10  classification_id  45716 non-null  int64
 11  category           45711 non-null  object
dtypes: float64(3), int64(3), object(6)
memory usage: 4.2+ MB

In [4]:
df.head()

,name,id,name_type,class,mass,fall,year,lat,long,geolocation,classification_id,category
0,Aachen,1,Valid,L5,21.0,Fell,1880,50.77500,6.08333,"(50.775, 6.08333)",3,Chondrite
1,Aarhus,2,Valid,H6,720.0,Fell,1951,56.18333,10.23333,"(56.18333, 10.23333)",4,Chondrite
2,Abee,6,Valid,EH4,107000.0,Fell,1952,54.21667,-113.00000,"(54.21667, -113.0)",112,Chondrite
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976,16.88333,-99.90000,"(16.88333, -99.9)",56,Achondrite
4,Achiras,370,Valid,L6,780.0,Fell,1902,-33.16667,-64.95000,"(-33.16667, -64.95)",1,Chondrite